<template>
  <section id="book" class="text">
    <div class="wrap">
      <div class="about left-col">
        <h2><strong>বই সম্পর্কে</strong></h2>
        <p>
         “Make Love, not war” কথাটি আপনার অত্যন্ত প্রিয় হতেই পারে। যেকোন যুদ্ধের বিরুদ্ধে আপনার সোচ্চার হওয়াটাও  অযৌক্তিক নয়। তবে যে যুদ্ধটা নিয়ে হয়তো আপনি কখনোই মাথা ঘামাননি, ফলাফল নিয়ে চিন্তা করেননি, অথচ যার সুফল কিংবা কুফল ঠিকি ভোগ করছেন, সেই যুদ্ধটার ক্ষেত্র আপনার নিজের শরীর। রোগ জীবাণুর বিরুদ্ধে যুদ্ধ।
        </p>
        <p>
          আপনার শরীরের কিছু অংশ আপনার খুব পরিচিত। কংকাল তন্ত্র দিচ্ছে দেহের কাঠামো, পেশীগুলো সাহায্য করছে নড়াচড়ায়, পরিপাকতন্ত্র খাবার থেকে পুষ্টি সংগ্রহে কাজ করছে ইত্যাদি বিষয়গুলো সহজেই অনুধাবনযোগ্য। তবে ইমিউন সিস্টেম যে যুদ্ধটা করছে আপনাকে সুস্থ রাখার তা আমরা বেশিরভাগ সময়েই বুঝতে পারিনা। দেহের একাধিক অঙ্গ-প্রত্যঙ্গ, বিভিন্ন গ্রন্থি, নানা ধরনের কোষ এবং শত বা তারও বেশি জিন মিলে যে চমৎকার অর্কেস্ট্রা গঠন করেছে 'ইমিউন সিস্টেম' নামে, তার কদরটা বুঝতে আমাদের সাধারণত বিশ্ববিদ্যালয় পর্যন্ত অপেক্ষা করতে হয়। যদি কি না জীবন বিজ্ঞান সংক্রান্ত বিষয় নিয়ে উচ্চ শিক্ষা গ্রহণে ইচ্ছুক হই।    
        </p>
        <p>
            সারা বিশ্বে জীব বিজ্ঞানের যে কয়েকটি শাখা নিয়ে মারদাঙ্গা সব গবেষণা হচ্ছে তার মধ্যে ইমিউনোলজি অন্যতম। অ্যালার্জি থেকে শুরু করে ক্যান্সার, প্যারাসিটামল থেকে শুরু করে ভ্যাক্সিন, এরকম বিশদ সংখ্যক রোগ এবং প্রতিকারে ইমিউনোলজির জ্ঞান কাজে লাগে। সেসব বাদ দিলেও নিজের শরীরে রোগ কিভাবে সৃষ্টি হয় আর জীবাণুর বিরুদ্ধে কিভাবে শরীর কিভাবে নিরাপত্তা দেয় তা জানা প্রয়োজন। এই সচেতনতা থাকেনা বলেই অনেকে ভাইরাস ঘটিত জ্বরে অ্যান্টিবায়োটিক খেয়ে নিজের এবং জাতির মারাত্নক ক্ষতির কারণ হয়ে যান।
        </p>
        <p>
            বইটিতে চেষ্টা করা হয়েছে জীবন ও জীবাণুর রেষারেষি নিয়ে কিছুটা ধারণা দেওয়ার। অণুজীবের সমুদ্রে ডুবে থেকেও ইমিউন সিস্টেম কিভাবে আপনাকে বাঁচিয়ে রাখছে, জীবাণুরা ইমিউন সিস্টেমকে ফাঁকি দিতে কি সব চালাকি করছে, কিভাবে ইমিউন সিস্টেম বিগড়ে গিয়ে উপকারের তুলনার ক্ষতির কারণ হচ্ছে ইত্যাদি আগ্রোহদ্দীপক বিষয়ে আলোকপাত করার। 
        </p>
        <p class="swipe">
          <!-- <em>Swipe left-to-right on the image below to preview the book.</em> -->
        </p>
      </div>
      <div class="reviews right-col">
        <h2><strong>পাঠকের মন্ত্যব্য</strong></h2>

        <slick ref="slick" :options="slickOptions">
          <div v-for="review in reviews" :key="review.id">
            <blockquote style="width: 100%; display: inline-block">
              <p>
                {{ review.content }}
              </p>
              <cite
                ><a
                  href="#"
                  target="_blank"
                  tabindex="-1"
                  >{{ review.name }}</a
                >, {{ review.designation }}</cite
              >
            </blockquote>
          </div>
        </slick>
      </div>
    </div>
  </section>
</template>

<script>
import Slick from "vue-slick";
export default {
  name: "AboutNReview",
  components: { Slick },
  data() {
    return {
      slickOptions: {
        slidesToShow: 1,
        prevArrow: null,
        nextArrow:
          '<button class="slide-arrow next-arrow">পরবর্তী মন্ত্যব্য </button>',
      },
      reviews:[
          {
              id:0,
              content: 'বৃহস্পতিবার নিউ ইয়র্কে বিডিনিউজ টোয়েন্টিফোর ডটকমকে দেওয়া এক সাক্ষাতকারে তিনি বলেছেন, বাংলাদেশ পূর্ব ইউরোপের ওই যুদ্ধ পরিস্থিতি ‘পর্যবেক্ষণ করছে’। মহামারিতে ক্ষত-বিক্ষত বিশ্ব ভয়ঙ্কর যুদ্ধ দেখতে আগ্রহী নয়। বাংলাদেশও উদ্ভূত পরিস্থিতির শান্তিপূর্ণ নিষ্পত্তি চায় এবং সেটি হতে পারে জাতিসংঘ চার্টারের আলোকে।',
              name:'এ কে আব্দুল মোমেন',
              designation: 'পররাষ্ট্র মন্ত্রী, বাংলাদেশ সরকার' 
          },
          {
              id: 1,
              content: 'সাবেক সোভিয়েত ইউনিয়ন থেকে স্বাধীন হওয়া ইউক্রেইন যুক্তরাষ্ট্র নেতৃত্বাধীন সামরিক জোট নেটোতে যোগ দিতে চায়, যা নিয়ে রাশিয়ার ঘোর আপত্তি। অন্যদিকে যুক্তরাষ্ট্র ও মিত্ররা ইউক্রেইনকে সমর্থন দিচ্ছে, এ নিয়ে উত্তেজনা চলছিল গত সাড়ে তিন মাস ধরেই।',
              name:'রুহশান আহমেদ',
              designation:'সফটওয়ার ইঞ্জিনিয়ার, বিকাশ লিমিটেড'
          }
      ]
    };
  },
};
</script>