<template>
  <section id="book" class="text">
    <div class="wrap">
      <div class="about left-col">
        <h2><strong>বই সম্পর্কে</strong></h2>
        <div>
          <img :src="require('../assets/samplePages/cover.png')" style="height:200px; float:left; margin: 5px"/>
          <p style="text-align: justify">
          আপনার শরীরের কিছু অংশ আপনার খুব পরিচিত। কংকাল তন্ত্র দিচ্ছে দেহের কাঠামো, পেশীগুলো সাহায্য করছে নড়াচড়ায়, পরিপাকতন্ত্র খাবার থেকে পুষ্টি সংগ্রহে কাজ করছে ইত্যাদি বিষয়গুলো সহজেই অনুধাবনযোগ্য। তবে ইমিউন সিস্টেম যে যুদ্ধটা করছে আপনাকে সুস্থ রাখার তা আমরা বেশিরভাগ সময়েই বুঝতে পারিনা। দেহের একাধিক অঙ্গ-প্রত্যঙ্গ, বিভিন্ন গ্রন্থি, নানা ধরনের কোষ এবং শত বা তারও বেশি জিন মিলে যে চমৎকার অর্কেস্ট্রা গঠন করেছে 'ইমিউন সিস্টেম' নামে, তার কদরটা বুঝতে আমাদের সাধারণত বিশ্ববিদ্যালয় পর্যন্ত অপেক্ষা করতে হয়। যদি কি না জীবন বিজ্ঞান সংক্রান্ত বিষয় নিয়ে উচ্চ শিক্ষা গ্রহণে ইচ্ছুক হই।    
        </p>
        </div>
        <p style="text-align: justify">
            বইটিতে চেষ্টা করা হয়েছে জীবন ও জীবাণুর রেষারেষি নিয়ে কিছুটা ধারণা দেওয়ার। অণুজীবের সমুদ্রে ডুবে থেকেও ইমিউন সিস্টেম কিভাবে আপনাকে বাঁচিয়ে রাখছে, জীবাণুরা ইমিউন সিস্টেমকে ফাঁকি দিতে কি সব চালাকি করছে, কিভাবে ইমিউন সিস্টেম বিগড়ে গিয়ে উপকারের তুলনার ক্ষতির কারণ হচ্ছে ইত্যাদি আগ্রোহদ্দীপক বিষয়ে আলোকপাত করার। 
        </p>
        <p class="swipe">
          <!-- <em>Swipe left-to-right on the image below to preview the book.</em> -->
        </p>
      </div>
      <div class="reviews right-col">
        <h2><strong>পাঠকের মন্তব্য</strong></h2>

        <slick ref="slick" :options="slickOptions">
          <div v-for="review in reviews" :key="review.id">
            <blockquote style="width: 100%; display: inline-block">
              <p class="readers-comment">
                {{ review.content }}
              </p>
              <cite
                ><a
                  href="#"
                  target="_blank"
                  tabindex="-1"
                  >{{ review.name }}</a
                >, {{ review.designation }}</cite
              >
            </blockquote>
          </div>
        </slick>
      </div>
    </div>
  </section>
</template>

<script>
import Slick from "vue-slick";
export default {
  name: "AboutNReview",
  components: { Slick },
  data() {
    return {
      slickOptions: {
        slidesToShow: 1,
        prevArrow: null,
        nextArrow:
          '<button class="slide-arrow next-arrow">পরবর্তী মন্ত্যব্য </button>',
      },
      reviews:[
          {
              id:0,
              content: 'ইমিউনোলজি এত গুরুত্বপূর্ণ একটা বিষয় হলেও এটা বেশ জটিল। বাংলাতে এ বিষয়ের উপর লেখা কোন সহজবোধ্য বইও নেই। এমনকি বিশ্ববিদ্যালয় পর্যায়েও এই অনাক্রম্য ব্যবস্থার পাঠ্যপুস্তক বুঝতে গিয়ে খাবি খেতে হয়। রুহশান আহমেদ অত্যন্ত সুচারুভাবে এই জটিল বিষয়কে সহজে উপস্থাপন করেছে।',
              name:'আরাফাত রহমান',
              designation: 'বিজ্ঞান লেখক ও পিএইচডি গবেষক,ইউনিভার্সিটি অফ ক্যালিফোর্নিয়া, রিভারসাইড' 
          },
          {
            id:1,
            content: 'ইমিউন সিস্টেম কিভাবে কাজ করে তা যদি গল্পের মত করে পড়ে বুঝতে চান, আমি বইটি কেনার জন্য আপনাকে রিকমেন্ড করব। ',
            name: 'মাহমুদুন্নবী রাব্বী', 
            designation: 'পিএইচডি গবেষক, কুইন্সল্যান্ড মাইক্রো এন্ড ন্যানোটেকনোলজি সেন্টার, গ্রিফিথ ইউনিভার্সিটি,  অস্ট্রেলিয়া'
          },
          {
            id:2,
            content: 'ইমিউন সিস্টেম বা অনাক্রম্য ব্যাবস্থা নিয়ে মুটামুটি আমরা সবাই জানি যে এই সিস্টেম আমাদের রোগ-জীবাণু থেকে রক্ষা করে। কিন্তু এই ইমিউন সিস্টেমের ভেতরে কি চলছে, কিভাবে চলছে তা হয়ত জীববিজ্ঞানের ছাত্র ছাড়া খুব কম মানুষেরই জানা । ইংরেজিতে এই ইমিউন সিস্টেম নিয়ে অনেক বই থাকলেও বাংলায় বই খুব একটা নেই। তাই বাংলা ভাষাভাষীদের কাছে খুব সহজ ভাষায় বইটি রচনা করেছেন রুহশান আহমেদ সাহেব । আশা করি  সবার কাছেই বইটি ভাল লাগবে।',
            name: 'মোহসিনা মৌ',
            designation:'স্নাতক, জেনেটিক ইঞ্জিনিয়ারিং এন্ড বায়োটেকনোলজি, সাস্ট'
          }
      
      ]
    };
  },
};
</script>