<template>
  <section id="chapters" class="text chapters">
    <div class="wrap">
      <h2>সূচীপত্র</h2>


      <div class="chapter" v-for="chapter in chapters" :key="chapter.id">
        <h3><span>{{chapter.page}}</span><a href="">{{chapter.title}}</a></h3>
        <p style="font-style: normal !important">
          {{chapter.summary}}
        </p>
        <p></p>
      </div>


    </div>
  </section>
</template>

<script>
export default {
  name: "Chapters",
  data() {
    return {
      chapters: [
        {
          id: 1,
          title: "ভূমিকা",
          summary:
            "বইটির উদ্দেশ্য, কেন ইমিউন সিস্টেম সম্পর্কে জানা দরকার, বইতে যা রয়েছে এবং যাদের প্রতি কৃতজ্ঞ",
          page: "১০",
        },
        {
          id: 1,
          title: "আমাদের অনাক্রম্য ব্যবস্থা",
          summary:
            "ইমিউন সিস্টেমের সংক্ষিপ্ত ধারনা, সাথে জড়িত বিভিন্ন কোষের সম্পর্কে আলোকপাত",
          page: "১১",
        },
        {
          id: 2,
          title: "অ্যান্টিবডি",
          summary:
            "অ্যান্টিবডির ইতিহাস, গঠন এবং এর বৈচিত্র্য যে কারণে আমাদের টিকে থাকার জন্য জরুরী",
          page: "২১",
        },
        {
          id: 3,
          title: "অ্যান্টিবডি যেভাবে কাজ করে",
          summary:
            "অনাক্রম্য ব্যবস্থার অন্যতম অস্ত্র অ্যান্টিবডি যেভাবে সংক্রমণের বিরুদ্ধে কাজ করে এবং সংক্রমণ প্রতিরোধ করে",
          page: "৩১",
        },
        {
          id: 4,
          title: "বি কোষ ও টি কোষ",
          summary:
            "যেসব মজার দূর্ঘটনার মাধ্যমে আমরা বি কোষ এবং টি কোষ সম্পর্কে জানলাম",
          page: "৩৮",
        },
        {
          id: 5,
          title: "আবারও টি কোষ",
          summary:
            "টি কোষের বিভিন্ন প্রকরণ, সংক্রমণে টি কোষের আচরণ",
          page: "৪২",
        },
        {
            id: 6,
            title: "ব্যাকটেরিয়া ও অনাক্রম্য ব্যবস্থা",
            summary: "ব্যাকটেরিয়ার বিরুদ্ধে আমাদের ইমিউন সিস্টেমের অ্যান্টিবডি, টি কোষ, বি কোষ যেভাবে সম্মিলিতভাবে প্রতিরোধ করে",
            page: "৪৮"
        },
        {
            id: 7,
            title: "ভাইরাস ও অনাক্রম্য ব্যবস্থা",
            summary: "যে কারণে ভাইরাস ব্যাতিক্রম এবং এর বিরুদ্ধে ইমিউন সিস্টেমের যত কৌশল",
            page: "৪৮"
        },
        {
            id: 8,
            title: "সুরক্ষা যখন সমস্যা",
            summary: "যখন রোগ জীবাণু দমন করতে গিয়ে ইমিউন সিস্টেম আমাদেরই ক্ষতি করে বসে",
            page: "৫৯"
        },
        {
            id: 9,
            title: "অ্যালার্জি",
            summary: "অ্যালার্জির ইতিহাস এবং ইমিউন সিস্টেমের সাথে এর সম্পর্ক",
            page: "৬৯"
        },
        {
            id: 10,
            title: "প্রাইমারি ইমিউন ডেফিসিয়েন্সি",
            summary: "ইমিউন সিস্টেমের ত্রুটি সঙ্ক্রান্ত বিভিন্ন রোগব্যাধি এবং সেসবের চিকিৎসা",
            page: "৭৮"
        },
        {
            id: 11,
            title: "অটোইমিউনিটি",
            summary: "ইমিউন সিস্টেমের স্বাভাবিক প্রক্রিয়া গুলো যখন অস্বাভাবিক হয়ে আমাদের ক্ষতি করে",
            page: "৮৮"
        },
        {
            id: 12,
            title: "অনাক্রম্য ব্যবস্থা ও ক্যান্সার ",
            summary: "ক্যান্সার কী, কেন এবং ইমিউন সিস্টেমের সাথে তার সম্পর্ক",
            page: "৮৮"
        },
        {
            id: 13,
            title: "টিকা",
            summary: "টিকার ইতিহাস এবং কিভাবে তা কাজ করে",
            page: "১০৭"
        },
        {
            id: 14,
            title: "কোভিড-১৯",
            summary: "কোভিড-১৯ করোনা ভাইরাস, এর রোগতত্ব এবং টিকা সম্পর্কে",
            page: "১১৭"
        },
      ],
    };
  },
};
</script>